# На вход подается словарь со списком вещей для похода в качестве ключа и их массой max_weight в качестве значения.
# Определите какие вещи влезут в рюкзак backpack передав его максимальную грузоподъёмность.
# В переменную backpack сохраните словарь {предмет: вес} с вещами в рюкзаке.
# В переменную result выведите список, содержащий все возможные варианты backpack. Напечатайте переменную result.
# *Верните все возможные варианты комплектации рюкзака.

# Пример
#
# На входе:

# items = {
#     "ключи": 0.3,
#     "кошелек": 0.2,
#     "телефон": 0.5,
#     "зажигалка": 0.1
# }
# max_weight = 1.0

# На выходе:

# [{'ключи': 0.3},
#  {'кошелек': 0.2},
#  {'ключи': 0.3, 'кошелек': 0.2},
#  {'телефон': 0.5},
#  {'ключи': 0.3, 'телефон': 0.5},
#  {'кошелек': 0.2, 'телефон': 0.5},
#  {'ключи': 0.3, 'кошелек': 0.2, 'телефон': 0.5},
#  {'зажигалка': 0.1},
#  {'зажигалка': 0.1, 'ключи': 0.3},
#  {'зажигалка': 0.1, 'кошелек': 0.2},
#  {'зажигалка': 0.1, 'ключи': 0.3, 'кошелек': 0.2},
#  {'зажигалка': 0.1, 'телефон': 0.5},
#  {'зажигалка': 0.1, 'ключи': 0.3, 'телефон': 0.5},
#  {'зажигалка': 0.1, 'кошелек': 0.2, 'телефон': 0.5},
#  {'ключи': 0.3, 'кошелек': 0.2, 'телефон': 0.5}]

from itertools import combinations
import pprint

items = {
    "ключи": 0.3,
    "кошелек": 0.2,
    "телефон": 0.5,
    "зажигалка": 0.1
}
max_weight = 1.0

# items = {
#     "ноутбук": 2.0,
#     "книги": 1.5,
#     "зарядное устройство": 0.5,
#     "бутерброды": 0.3,
#     "вода": 1.0
# }
# max_weight = 5.0

# items = {
#     "лодка": 3.0,
#     "велосипед": 4.0,
#     "мангал": 2.0
# }
# max_weight = 1.0

# items = {
#     "спальник": 1.5,
#     "палатка": 3.2,
#     "термос": 0.6,
#     "карта": 0.1,
#     "фонарик": 0.3,
#     "котелок": 0.8,
#     "еда": 2.5,
#     "одежда": 1.7,
#     "обувь": 1.2,
#     "нож": 0.2
# }
# max_weight = 7

# items = {
#     "спальник": 2.0,
#     "палатка": 3.5,
#     "термос": 0.8,
#     "карта": 0.2,
#     "фонарик": 0.5,
#     "котелок": 1.0,
#     "еда": 3.0,
#     "одежда": 1.8,
#     "обувь": 1.0,
#     "нож": 0.3
# }
# max_weight = 10

# items = {
#     "спальник": 1.5,
#     "палатка": 3.2,
#     "термос": 0.6,
#     "карта": 0.1,
#     "фонарик": 0.3,
#     "котелок": 0.8,
#     "еда": 2.5,
#     "одежда": 1.7,
#     "обувь": 1.2,
#     "нож": 0.2
# }
# max_weight = 1

# items = {
#     "спальник": 1.0,
#     "палатка": 2.0,
#     "термос": 0.5,
#     "карта": 0.1,
#     "фонарик": 0.2,
#     "котелок": 0.5,
#     "еда": 2.0,
#     "одежда": 1.0,
#     "обувь": 0.8,
#     "нож": 0.2
# }
# max_weight = 10

backpacks = []
sorted_result = []

for i in range(2 ** len(items)):
    backpack = {}
    weight = 0
    for j, item in enumerate(items):
        if i & (1 << j):
            if weight + items[item] <= max_weight:
                backpack[item] = items[item]
                weight += items[item]
            else:
                break
    backpacks.append(backpack)

full_result = [backpack for backpack in backpacks if backpack]
result = []

for item in full_result:
    if item not in result:
        result.append(item)

pprint.pprint(result)